/*
Тема: Перезавантаження операцій і функцій.
Шаблони функцій
Завдання
 Перезавантажити функції для різних типів вхідних даних, або створити шаблони функцій,
 або перевизначити операції для  означених користувачем типів 
 (нові типи задавати у вигляді структур) .
 Для тих варіантів завдань, де треба використовувати структурний тип, у описі
 типу використовувати лише члени дані. А всі необхідні оператори і функції визначити
 за межами структури.


10. Визначити операцію логічного віднімання двох рядків символів S3=S1-S2.
 Рядок S3 складається з символів, які  належать рядку S1 і не належать S2.
 Врахувати кількість однакових символів в обох рядках
 (наприклад, якщо в 1-му рядочку 2 символи ‘а’, а в 2-му 1 такий символ, 
 то в результат попадає 1 символ ‘a’). Використати перезавантаження операторів.
 Не використовувати динамічні зміні.


*/
#include <iostream>

using namespace std;

struct X{
    char arr[266];
} 

opminus()

int main() {

   return 0;
}
