%3.	Робота з масивами (5 балів)
%3.1.	Створити змінну х=5 .За допомогою функції size переконатись в тому що змінна є масивом. 
%3.2.	Створити одиничну матрицю А розміром 4х4. 
%3.3.	 Створити масив В, заповнений нулями, розміром 5х4. 
%3.4.	Створити масив С , заповнений одиницями, розміром 5х5. 
%3.5.	Створити матрицю, розміром 3х3, заповнену числом 7.
%3.6.	Здійснити вертикальну конкатенацію масивів А та В.
%3.7.	Виконати горизонтальну конкатенацію масивів В та С.
%3.8.	Згенерувати матрицю випадкових чисел, розміром 6х7, з рівномірним розподілом.
%3.9.	Створити масив М:
%M =
%   1   2   3
%   4   5   6
%   7   8   9 
%3.10.	Видалити в матриці М другий рядок.
%3.11.	За допомогою функції prod вивести результат перемноження всіх елементів масиву M по стовпцях.
%3.12.	Просумувати елементи матриці М по рядках.
%3.13.	Вивести поелементний добуток двох масивів S та S1: S(1,2,3,4), S1(4,5,7,3). 
%3.14.	Створити масив Р(-1 -2 3; 1 2 3; 4 5 -2). Вивести індекси елементів, які менші за нуль. 
%3.15.	Ввести довільну матрицю, та визначити для неї
%                   − визначник матриці; 
%− транспоновану матрицю; 
%− обернену матрицю; 
%− слід матриці;
%− власні значення і власні вектори матриці.
x=5;                        disp(size(x));%1
A = eye(4);                 disp(A);      %2
B = zeros(5, 4);            disp(B);      %3
C = ones(5, 5);             disp(C);      %4
D = ones(3, 3) * 7;         disp(D);      %5
E = [A; B];                 disp(E);      %6
F = [B, C];                 disp(F);      %7
 R = rand(6, 7);            disp(R);      %8
 M = [1 2 3; 4 5 6; 7 8 9];               %9
 M(2, :) = [];              disp(M);      %10
G = prod(M);                disp(G);      %11
H = sum(M, 2);              disp(H);      %12
 S = [1 2 3 4]; S1 = [4 5 7 3];           %
 S_prod = S .* S1;          disp(S_prod); %13
 P=[-1 -2 3; 1 2 3; 4 5 -2];              %
 idxs = find(P < 0);        disp(idxs);   %14
                                          %
I = rand(4, 4);                           %
det_I = det(I);             disp(det_I);  %
trans_I = I';               disp(trans_I);%
inv_I = inv(I);             disp(inv_I);  %
tr_I = trace(I);            disp(tr_I);   %
[V, Val] = eig(I);          disp(V);      %
                            disp(Val);    %15
