%1.1.  Створити вектор-рядок V.
%1.2.   Знайти та вивести його розмір. Транспонувати його. Знайти векторний добуток.
%1.3.  Збільшити кожен елемент даного вектора в i раз (де і- номер варіанту), використовуючи операцію множення. 
%1.4.  Застосувати одну із тригонометричних функцій (cos) до вектора V. 
%1.5.   Створити вектор-стовбець V1 з елементами попереднього вектора. 
%1.6.  Знайти добуток V*V1. 
%1.7.  Вивести перший та третій елемент вектора V . 
%1.8.  Обчислити найбільший та найменший елемент вектора V та вивести його та його індекс на екран.
%1.9.  Знайти середнє арифметичне елементів вектора V. 
%1.10.  Посортувати елементи вектора V. 
%1.11.   Знайти суму та добуток елементів вектора V. 
%1.12.  Створити вектор Х=(1 2 3 4 5 6 7 8 ) та виконати в ньому перестановку половин вектора. Результат присвоїти змінній Х1. 

V = [1, 2, 3]; %1.1
disp(size(V)); %1.2
disp(V');%1.2
V2 = [3, 2, 1];%1.2
V3 = cross(V,V2);%1.2
disp(V3);%1.2
disp(V*3);%1.3
disp(sin(V));%1.4
disp(V(:));%1.5
V1=V;
disp(V.*V1);%1.6
disp(V(1)); disp(V(3));%1.7
[valmx, idxmx] = max(V); [valmn, idxmn] = min(V);%1.8
disp([valmx, idxmx]); disp([valmn, idxmn]);%1.8
disp(mean(V));%1.9
disp(sort(V));%1.10
disp(sum(V)); disp(prod(V));%1.11
X = 1:8;%1.12
X1 = X(5:8), X(1:4);%1.12
disp(X1);%1.12
