%Знайдіть частку від ділення многочлена P(x) на Q(x)
%a) P(x) = x^3 + 1, Q(x) = x+1;         [1 0 0 1],[1 1]               
%b) P(x) = x^4 - 1, Q(x) = x^2-2x+1;    [1 0 0 0 -1],[1 -2 1]          ____________
%в) P(x) = x^3 - 1, Q(x) = x^2 + x + 1; [1 0 0 -1],[1 1 1]            |Вводити лише|
%г) P(x) = x^4 - 1, Q(x) = x - 1.       [1 0 0 0 -1],[1 -1]           |Вектори!!!  |
%                                                                     --------------    

for i = 1:4                                  
P = input("P:");
Q = input("Q:");
[S,R] = deconv(P, Q);

disp('Частка S(x):');
disp(poly2str(S, 'x'));

disp('Частка R(x):');
disp(poly2str(R, 'x'));
end
